/*!
@file Character.h
@brief キャラクターなど
@copyright shike.y
*/

#pragma once
#include "stdafx.h"

namespace basecross
{
	//--------------------------------------------------------------------------------------
	//	四角形スプライト
	//--------------------------------------------------------------------------------------
	class SquareSprite : public ObjectInterface, public ShapeInterface {

	public:
		//--------------------------------------------------------------------------------------
		/*!
		@brief コンストラクタ
		*/
		//--------------------------------------------------------------------------------------
		SquareSprite(const wstring& TextureFileName, bool Trace, const Vec2& StartPos);

		//--------------------------------------------------------------------------------------
		/*!
		@brief デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		virtual ~SquareSprite();

		//--------------------------------------------------------------------------------------
		/*!
		@brief 初期化
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnCreate() override;

		//--------------------------------------------------------------------------------------
		/*!
		@brief 更新
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnUpdate()override;

		//--------------------------------------------------------------------------------------
		/*!
		@brief 描画
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnDraw()override;

	private:
		
		shared_ptr<MeshResource> m_SquareMesh;	// メッシュ
		wstring m_TextureFileName;				//テクスチャファイル名
		bool m_Trace;							//透明処理するかどうか
		shared_ptr<TextureResource> m_TextureResource;	//テクスチャリソース
		Col4 m_Diffuse;							//変化させるデフィーズ


		Vec2 m_Scale;				///<スケーリング
		float m_Rot;				///<回転角度
		Vec2 m_Pos;					///<位置
		Vec2 m_PosSpan;				///<位置変更間隔

		float m_TotalTime;			///<タイム

	};
}
//end basecross