/*!
@file RmManager.cpp
@brief 簡易物理計算マネージャ
@copyright Copyright (c) 2017 WiZ Tamura Hiroki,Yamanoi Yasushi.
*/
#include "stdafx.h"

namespace basecross {

	//--------------------------------------------------------------------------------------
	//	簡易物理計算マネージャ
	//--------------------------------------------------------------------------------------
	//--------------------------------------------------------------------------------------
	//private:
	//--------------------------------------------------------------------------------------
	void RmManager::SetStateFromTrans() {

	}

	//--------------------------------------------------------------------------------------
	//public:
	//--------------------------------------------------------------------------------------
	RmManager::RmManager(const shared_ptr<Stage>& StagePtr) :
		GameObject(StagePtr),
		m_PairSwap(0),
		m_BeforePairSwap(1 - m_PairSwap)
	{}
	RmManager::~RmManager() {}

	//--------------------------------------------------------------------------------------
	//override
	//--------------------------------------------------------------------------------------
	void RmManager::OnCreate() {

	}

	void RmManager::OnUpdate() {
		//ペアのスワップ
		m_BeforePairSwap = m_PairSwap;
		m_PairSwap = 1 - m_PairSwap;
		//ステップ1: フォースの実装


	}

	//--------------------------------------------------------------------------------------
	//publicfunc
	//--------------------------------------------------------------------------------------
	void RmManager::InitForce() {

	}



}
//end basecross
